Tekla Open API Reference for Tekla Structures 2025
IncludeRevisionMarkEnum Enumeration
 Options for including a revision info in file name
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum IncludeRevisionMarkEnum
Public Enumeration IncludeRevisionMarkEnum
Members
Member name | Value | Description
Never | 0 |  Never include revision info
Always | 1 |  Always include revision info
ByFormatString | 2 |  Include revision info if it's present in the format string, otherwise not
See Also
Reference
Tekla.Structures.Drawing Namespace